# Creación de dimensiones, tabla de hechos y subir base de mysql

In [1]:
import pandas as pd
import numpy as np
import boto3
import psycopg2
import configparser
from faker import Faker
import random
from datetime import datetime, timedelta
import matplotlib.pyplot as plt

In [2]:
config = configparser.ConfigParser()
config.read('config_pf.cfg')

['config_pf.cfg']

In [3]:
aws_rds_conn = boto3.client('rds',aws_access_key_id=config.get('IAM','ACCES_KEY'),
                             aws_secret_access_key=config.get('IAM','SECRETE_ACCES_KEY'),region_name='us-east-1')

In [4]:
try:
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('TRANSACC','DB_INSTANCE_ID'))
    RDS_HOSTNAME= instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
except Exception as ex:
    print('Error!!!',ex)

banco-transactional-pf.cj0y8e88oxze.us-east-1.rds.amazonaws.com

In [5]:
driver = f"""postgresql://{config.get('TRANSACC', 'DB_USER')}:{config.get('TRANSACC', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('TRANSACC', 'DB_PORT')}/{config.get('TRANSACC', 'DB_NAME')}"""  
driver

'postgresql://postgres_admin:BawemEteTAy0vuvePeswOnutr@banco-transactional-pf.cj0y8e88oxze.us-east-1.rds.amazonaws.com:5432/bancopf'

## Dimensión clientes

In [19]:
sql_query = 'SELECT * FROM cliente;'
df_cliente = pd.read_sql(sql_query, driver)
df_cliente.head()

,id_cliente,nombre_cliente,genero_cliente,tipo_documento,num_documento,direccion,telefono,email
0,0,Tara Simmons,2002,A+,646-54-4288,2643 Jennifer Viaduct Suite 288\nNorth Georgeb...,79482097,stephaniethomas@yahoo.com
1,1,Randy Carter,2003,B-,418-69-7405,USS Bailey\nFPO AE 88489,36746662,lawrencelopez@gmail.com
2,2,Amanda Reynolds,2002,AB-,732-13-1954,"622 Patterson Lakes Apt. 285\nNew Raymond, OR ...",74516800,portermichael@yahoo.com
3,3,Erika Fox,2003,AB-,443-05-0152,"42774 Pruitt Trail Apt. 599\nWrightborough, CA...",53191139,lindseyrhonda@gmail.com
4,4,Cathy Salazar,2003,A+,046-83-7365,"120 James Islands Apt. 622\nEricamouth, RI 72702",61734732,underwoodbrian@yahoo.com

Esta dimensión se deja tal cual esta dado, que no hay otros campos de clientes en las otras tablas

In [20]:
dim_cliente = df_cliente

## Articulo

In [21]:
sql_query = 'SELECT * FROM articulo;'
df_articulo = pd.read_sql(sql_query, driver)
df_articulo.columns = ["id_articulo","nombre_articulo","id_categoria","codigo_art","precio_venta","stock","descripcion_art","imagen","estado_art"]
df_articulo.head()

,id_articulo,nombre_articulo,id_categoria,codigo_art,precio_venta,stock,descripcion_art,imagen,estado_art
0,1,celular,1,1111,2500.0,1500,smart phone,imagen1,True
1,2,computadora,1,22221,6000.0,750,laptop,imagen2,True
2,3,tablet,1,3333,4000.0,400,apple,imagen3,True
3,4,lavadora,2,4444,5500.0,200,lg,imagen4,True
4,5,secadora,2,5555,5000.0,150,lg,imagen5,False

In [22]:
sql_query = 'SELECT * FROM categoria;'
df_categoria= pd.read_sql(sql_query, driver)
df_categoria.columns = ["id_categoria","nombre_categoria","descripcion_cat","estado_cat"]

df_categoria.head()

   id_categoria nombre_categoria descripcion_cat  estado_cat
0             1     electronicos    dispositivos        True
1             2     linea blanca    para la casa        True

In [23]:
sql_query = 'SELECT * FROM proveedor;'
df_proveedor= pd.read_sql(sql_query, driver)

df_proveedor.head()

   id_proveedor  id_articulo nombre_proveedor
0             1            1             Juan
1             2            2            Juana
2             3            3            Lucia
3             4            4             Luis
4             5            5           Monica

In [24]:
dim_articulo_aux = pd.merge(df_articulo, df_categoria, on='id_categoria', how='left')
dim_articulo = pd.merge(dim_articulo_aux, df_proveedor, on='id_articulo', how='left')
dim_articulo

,id_articulo,nombre_articulo,id_categoria,codigo_art,precio_venta,stock,descripcion_art,imagen,estado_art,nombre_categoria,descripcion_cat,estado_cat,id_proveedor,nombre_proveedor
0,1,celular,1,1111,2500.0,1500,smart phone,imagen1,True,electronicos,dispositivos,True,1,Juan
1,2,computadora,1,22221,6000.0,750,laptop,imagen2,True,electronicos,dispositivos,True,2,Juana
2,3,tablet,1,3333,4000.0,400,apple,imagen3,True,electronicos,dispositivos,True,3,Lucia
3,4,lavadora,2,4444,5500.0,200,lg,imagen4,True,linea blanca,para la casa,True,4,Luis
4,5,secadora,2,5555,5000.0,150,lg,imagen5,False,linea blanca,para la casa,True,5,Monica

## Usuario

In [25]:
sql_query = 'SELECT * FROM usuario;'
df_usuario = pd.read_sql(sql_query, driver)
df_usuario.columns = ["id_usuario","id_rol","nombre_usuario","tipo_documento","num_documento","direccion","telefono","email","clave","estado_usuario"]
df_usuario.head()

,id_usuario,id_rol,nombre_usuario,tipo_documento,num_documento,direccion,telefono,email,clave,estado_usuario
0,0,2,Margaret Hudson,O+,794-69-8469,"7644 Williams Isle Apt. 231\nThomasshire, TX 2...",33752177,wellslynn@gmail.com,trujillojessica,False
1,1,3,Daniel Thomas,AB-,705-46-6661,"532 Angel Well\nWest Davidshire, ME 99361",76626438,aadams@hotmail.com,shermanalexis,True
2,2,1,Christopher Adams,A+,214-82-1687,"3693 Johnston Parkway\nWest Andrew, NM 37207",84772158,dcunningham@yahoo.com,marymccoy,True
3,3,2,Travis Brown,AB+,076-26-1015,"0752 Carter Corner\nNorth Susan, VA 22408",80766440,ufranklin@yahoo.com,newtonnicholas,True
4,4,2,Kenneth Calderon,A+,159-92-4576,"635 Thomas Road\nEast Davidside, FL 57805",95020488,macdonalddavid@yahoo.com,georgehernandez,True

In [26]:
sql_query = 'SELECT * FROM rol;'
df_rol = pd.read_sql(sql_query, driver)
df_rol.columns = ["id_rol","nombre","descripcion","estado_rol"]
df_rol.head()

   id_rol          nombre descripcion  estado_rol
0       1            jefe    jefatura        True
1       2        vendedor  al detalle        True
2       3  administrativo     general        True

In [27]:
dim_usuario = pd.merge(df_usuario, df_rol, on='id_rol', how='left')
dim_usuario.head()

,id_usuario,id_rol,nombre_usuario,tipo_documento,num_documento,direccion,telefono,email,clave,estado_usuario,nombre,descripcion,estado_rol
0,0,2,Margaret Hudson,O+,794-69-8469,"7644 Williams Isle Apt. 231\nThomasshire, TX 2...",33752177,wellslynn@gmail.com,trujillojessica,False,vendedor,al detalle,True
1,1,3,Daniel Thomas,AB-,705-46-6661,"532 Angel Well\nWest Davidshire, ME 99361",76626438,aadams@hotmail.com,shermanalexis,True,administrativo,general,True
2,2,1,Christopher Adams,A+,214-82-1687,"3693 Johnston Parkway\nWest Andrew, NM 37207",84772158,dcunningham@yahoo.com,marymccoy,True,jefe,jefatura,True
3,3,2,Travis Brown,AB+,076-26-1015,"0752 Carter Corner\nNorth Susan, VA 22408",80766440,ufranklin@yahoo.com,newtonnicholas,True,vendedor,al detalle,True
4,4,2,Kenneth Calderon,A+,159-92-4576,"635 Thomas Road\nEast Davidside, FL 57805",95020488,macdonalddavid@yahoo.com,georgehernandez,True,vendedor,al detalle,True

## Ingreso

In [28]:
sql_query = 'SELECT * FROM ingreso;'
df_ingreso = pd.read_sql(sql_query, driver)
df_ingreso.head()

,id_ingreso,id_proveedor,id_usuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado
0,0,3,61,comprobante1,0-590-21887-5,30427585,2021-04-02,0.10,2833.0,False
1,1,1,76,comprobante1,1-9997978-4-1,55238901,2021-09-02,0.20,2543.0,True
2,2,2,149,comprobante1,1-66512-252-8,72622342,2020-09-29,0.20,3556.0,True
3,3,1,192,comprobante3,0-369-46460-5,74211536,2020-06-23,0.05,4354.0,True
4,4,2,47,comprobante1,1-894903-89-7,58663180,2022-04-28,0.20,2753.0,True

In [29]:
sql_query = 'SELECT * FROM detalle_ingreso;'
df_detalle_ingreso = pd.read_sql(sql_query, driver)
df_detalle_ingreso.head()

   id_detalle_ingreso nombre_ingreso  id_ingreso  id_articulo  cantidad
0                   0       ELKNGBL8           0            3       191
1                   1       NNBDGBZU           1            1       179
2                   2       ECZEGBWI           2            2       112
3                   3       AQIAGBGW           3            1        71
4                   4       XVWJGBIZ           4            2       148

In [30]:
dim_ingreso = pd.merge(df_ingreso, df_detalle_ingreso, on='id_ingreso', how='left')
dim_ingreso.head()

,id_ingreso,id_proveedor,id_usuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado,id_detalle_ingreso,nombre_ingreso,id_articulo,cantidad
0,0,3,61,comprobante1,0-590-21887-5,30427585,2021-04-02,0.10,2833.0,False,0,ELKNGBL8,3,191
1,1,1,76,comprobante1,1-9997978-4-1,55238901,2021-09-02,0.20,2543.0,True,1,NNBDGBZU,1,179
2,2,2,149,comprobante1,1-66512-252-8,72622342,2020-09-29,0.20,3556.0,True,2,ECZEGBWI,2,112
3,3,1,192,comprobante3,0-369-46460-5,74211536,2020-06-23,0.05,4354.0,True,3,AQIAGBGW,1,71
4,4,2,47,comprobante1,1-894903-89-7,58663180,2022-04-28,0.20,2753.0,True,4,XVWJGBIZ,2,148

## Venta

In [31]:
sql_query = 'SELECT * FROM venta;'
df_venta = pd.read_sql(sql_query, driver)
df_venta.head()

,id_venta,id_cliente,id_usuario,total,tipo_comprobante,serie_comprobante,fecha,impuesto,estado
0,0,342,30,7500,220-32702-9,1-09-815570-X,2023-12-01,0.12,TRUE
1,1,165,100,5000,8085-1875-7,0-87625-082-7,2022-09-22,0.12,TRUE
2,2,470,57,10000,371-54758-3,1-4271-5642-5,2020-04-10,0.12,TRUE
3,3,231,55,2500,396-25601-6,0-7062-2579-1,2021-06-25,0.12,TRUE
4,4,144,38,11000,8378-7325-9,0-10-308295-6,2020-07-30,0.12,FALSE

In [32]:
sql_query = 'SELECT * FROM detalle_venta;'
df_detalle_venta = pd.read_sql(sql_query, driver)
df_detalle_venta.head()

   id_detalle_venta  id_venta  id_articulo  precio  cantidad  descuento
0                 0         0            1    2500         3       0.15
1                 1         1            1    2500         2       0.05
2                 2         2            1    2500         4       0.05
3                 3         3            1    2500         1       0.05
4                 4         4            4    5500         2       0.15

In [33]:
dim_venta = pd.merge(df_venta, df_detalle_venta, on='id_venta', how='left')
dim_venta.head()

,id_venta,id_cliente,id_usuario,total,tipo_comprobante,serie_comprobante,fecha,impuesto,estado,id_detalle_venta,id_articulo,precio,cantidad,descuento
0,0,342,30,7500,220-32702-9,1-09-815570-X,2023-12-01,0.12,TRUE,0,1,2500,3,0.15
1,1,165,100,5000,8085-1875-7,0-87625-082-7,2022-09-22,0.12,TRUE,1,1,2500,2,0.05
2,2,470,57,10000,371-54758-3,1-4271-5642-5,2020-04-10,0.12,TRUE,2,1,2500,4,0.05
3,3,231,55,2500,396-25601-6,0-7062-2579-1,2021-06-25,0.12,TRUE,3,1,2500,1,0.05
4,4,144,38,11000,8378-7325-9,0-10-308295-6,2020-07-30,0.12,FALSE,4,4,5500,2,0.15

## Dimensión tiempo

In [34]:
sql_query = 'SELECT fecha FROM venta;'
df_time = pd.read_sql(sql_query, driver)
df_time.head()

       fecha
0 2023-12-01
1 2022-09-22
2 2020-04-10
3 2021-06-25
4 2020-07-30

In [84]:
df_time['year'] = pd.DatetimeIndex(df_time['fecha']).year
df_time['month'] = pd.DatetimeIndex(df_time['fecha']).month.astype(str).str.zfill(2)
df_time['quarter'] = pd.DatetimeIndex(df_time['fecha']).quarter
df_time['day'] = pd.DatetimeIndex(df_time['fecha']).day.astype(str).str.zfill(2)
df_time['week'] = pd.DatetimeIndex(df_time['fecha']).strftime('%U').astype(int)
df_time['dayofweek'] = pd.DatetimeIndex(df_time['fecha']).dayofweek
df_time['is_weekend'] = df_time['dayofweek'].apply(lambda x: 1 if x > 5 else 0)
df_time.head()

       fecha  year month  quarter day  week  dayofweek  is_weekend id_fecha
0 2023-12-01  2023    12        4  01    48          4           0  2023121
1 2022-09-22  2022    09        3  22    38          3           0  2022922
2 2020-04-10  2020    04        2  10    14          4           0  2020410
3 2021-06-25  2021    06        2  25    25          4           0  2021625
4 2020-07-30  2020    07        3  30    30          3           0  2020730

In [85]:
df_time['id_fecha'] = df_time['year'].astype(str) + df_time['month'].astype(str)
df_time['id_fecha'] = df_time['id_fecha'].astype(str) + df_time['day'].astype(str)
df_time.drop_duplicates(inplace=True)
dim_time =df_time
dim_time.head()

       fecha  year month  quarter day  week  dayofweek  is_weekend  id_fecha
0 2023-12-01  2023    12        4  01    48          4           0  20231201
1 2022-09-22  2022    09        3  22    38          3           0  20220922
2 2020-04-10  2020    04        2  10    14          4           0  20200410
3 2021-06-25  2021    06        2  25    25          4           0  20210625
4 2020-07-30  2020    07        3  30    30          3           0  20200730

## Tabla de hechos

In [99]:
sql_query = '''SELECT * from transacciones;'''
df_trans = pd.read_sql(sql_query, driver)
df_trans.head()

   id_transaccion  id_venta  id_ingreso
0               0         0         735
1               1         1         647
2               2         2          52
3               3         3        1072
4               4         4        1379

In [104]:
fact_table = pd.merge(df_trans, dim_venta[['id_venta', 'id_usuario', 'id_cliente','id_articulo','fecha']], on='id_venta', how='left')
fact_table

,id_transaccion,id_venta,id_ingreso,id_usuario,id_cliente,id_articulo,fecha
0,0,0,735,30,342,1,2023-12-01
1,1,1,647,100,165,1,2022-09-22
2,2,2,52,57,470,1,2020-04-10
3,3,3,1072,55,231,1,2021-06-25
4,4,4,1379,38,144,4,2020-07-30
...,...,...,...,...,...,...,...
4995,4995,4995,775,39,93,2,2023-03-26
4996,4996,4996,225,12,326,3,2022-05-23
4997,4997,4997,124,67,140,3,2023-07-28
4998,4998,4998,926,76,421,2,2022-09-16
4999,4999,4999,939,64,204,1,2022-01-15

In [105]:
fact_table['year'] = pd.DatetimeIndex(fact_table['fecha']).year
fact_table['month'] = pd.DatetimeIndex(fact_table['fecha']).month.astype(str).str.zfill(2)
fact_table['day'] = pd.DatetimeIndex(fact_table['fecha']).day.astype(str).str.zfill(2)
fact_table['id_fecha'] = fact_table['year'].astype(str) + fact_table['month'].astype(str)
fact_table['id_fecha'] = fact_table['id_fecha'].astype(str) + fact_table['day'].astype(str)

factTable_transacciones = fact_table.drop(['year', 'month', 'day','fecha'], axis=1)
factTable_transacciones.head()

,id_transaccion,id_venta,id_ingreso,id_usuario,id_cliente,id_articulo,id_fecha
0,0,0,735,30,342,1,20231201
1,1,1,647,100,165,1,20220922
2,2,2,52,57,470,1,20200410
3,3,3,1072,55,231,1,20210625
4,4,4,1379,38,144,4,20200730

# Crear base de datos de mysql

In [89]:
config = configparser.ConfigParser()
config.read('config_pf.cfg')

['config_pf.cfg']

In [90]:
rdsInstanceIds = []

response = aws_rds_conn.describe_db_instances()
for resp in response['DBInstances']:
    rdsInstanceIds.append(resp['DBInstanceIdentifier'])
    db_instance_status = resp['DBInstanceStatus']

print(f"DBInstanceIds {rdsInstanceIds}")

DBInstanceIds ['banco-dw', 'banco-dw-final', 'banco-dw-pf', 'banco-transactional', 'banco-transactional-pf']

In [7]:
try:
    response = aws_rds_conn.create_db_instance(
            AllocatedStorage=10,
            DBName=config.get('DW', 'DB_NAME'),
            DBInstanceIdentifier=config.get('DW','DB_INSTANCE_ID'),
            DBInstanceClass="db.t3.micro",
            Engine="mysql",
            MasterUsername=config.get('DW', 'DB_USER'),
            MasterUserPassword=config.get('DW', 'DB_PASSWORD'),
            Port=int(config.get('DW', 'DB_PORT')),
            VpcSecurityGroupIds=[config.get('VPC', 'SECURITY_GROUP')],
            PubliclyAccessible=True
        )
    print(response)
except aws_rds_conn.exceptions.DBInstanceAlreadyExistsFault as ex:
    print("La Instancia de Base de Datos ya Existe.")

La Instancia de Base de Datos ya Existe.

In [8]:
try:
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('DW','DB_INSTANCE_ID'))
    RDS_HOSTNAME= instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
except Exception as ex:
    print('Error!!!',ex)

banco-dw-final.cj0y8e88oxze.us-east-1.rds.amazonaws.com

In [9]:
import sql_queries_dw

In [13]:
import mysql.connector as mysqlC
try:
    myDw = mysqlC.connect(
    host=RDS_HOSTNAME, 
    user=config.get('DW', 'DB_USER'),
    password=config.get('DW', 'DB_PASSWORD'),
    database=config.get('DW', 'DB_NAME')
    )

    mycursor = myDw.cursor()
    mycursor.execute(sql_queries_dw.CREATE_DW, multi=True)
    myDw.commit()
    print("Data Warehouse Creado Exitosamente")
except Exception as ex:
    print("ERROR: Error al crear la base de datos.")
    print(ex)

ERROR: Error al crear la base de datos.
Commands out of sync; you can't run this command now

In [47]:
mysql_driver = f"""mysql+pymysql://{config.get('DW', 'DB_USER')}:{config.get('DW', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('DW', 'DB_PORT')}/{config.get('DW', 'DB_NAME')}"""  
mysql_driver

'mysql+pymysql://mysql_admin:BawemEteTAy0vuvePeswOnutr@banco-dw-final.cj0y8e88oxze.us-east-1.rds.amazonaws.com:3306/banco_dw_final'

### Insertar dimensión clientes

In [53]:
dim_cliente.to_sql('dim_cliente', mysql_driver, index=False, if_exists='append')

500

### Insertar dimensión usuario

In [54]:
dim_usuario.to_sql('dim_usuario', mysql_driver, index=False, if_exists='append')

200

### Insertar dimensión ingreso

In [56]:
dim_ingreso.to_sql('dim_ingreso', mysql_driver, index=False, if_exists='append')

1500

### Insertar dimensión articulo

In [57]:
dim_articulo.to_sql('dim_articulo', mysql_driver, index=False, if_exists='append')

5

### Insertar dimensión Ventas

In [63]:
dim_venta.to_sql('dim_venta', mysql_driver, index=False, if_exists='append')

5000

### Insertar fact_table

In [107]:
factTable_transacciones.to_sql('facts_table', mysql_driver, index=False, if_exists='append')

5000

In [ ]:
# Insertar dimensión tiempo

In [93]:
dim_time= dim_time.reindex(columns=["id_fecha","year","month","quarter","day","week","dayofweek","is_weekend","fecha"])
dim_time.head()

   id_fecha  year month  quarter day  week  dayofweek  is_weekend      fecha
0  20231201  2023    12        4  01    48          4           0 2023-12-01
1  20220922  2022    09        3  22    38          3           0 2022-09-22
2  20200410  2020    04        2  10    14          4           0 2020-04-10
3  20210625  2021    06        2  25    25          4           0 2021-06-25
4  20200730  2020    07        3  30    30          3           0 2020-07-30

In [94]:
dim_time.to_sql('dim_tiempo', mysql_driver, index=False, if_exists='append')

1418

# Subir a Github